class Answers:
    UNKNOWN_MESSAGE = "Я не знаю эту команду 🤷‍♂️"
    GREETING = "Привет 👋"
    HELP_COMMAND = "Нажми на кнопку ниже ⤵️"
    ADMIN_COMMAND = 'Панель управления ботом'
    BLOCKED_USER = "Ты заблокирован в боте!"
    INCORRECT_BUTTON_TEXT = "Используй кнопки!"
    USER_GUESSES_AGE = "Теперь ты угадываешь возраст 🔢"
    USER_NOT_GUESSES_AGE = "Теперь ты только оцениваешь людей 🔎"


class ChangeProfileAnswers(Answers):
    CHANGE_USER_NAME = "Отправь новое имя ⤵️"
    CHANGE_LOCATION = "Отправь локацию или город ⤵️"
    CHANGE_AGE = "Отправь новый возраст ⤵️"
    CHANGE_PHOTO = "Отправь новое фото ⤵️"
    CHANGE_PROFILE = "Выбери раздел, чтобы изменить его ⤵️"

    NAME_UPDATED = "Имя обновлено ✅"
    PHOTO_UPDATED = "Фото обновлено ✅"
    AGE_UPDATED = "Возраст обновлен ✅"
    LOCATION_UPDATED = "Город обновлен ✅"
