class Answers:
    USER_AGE_SECTION = "Сколько тебе лет?"
    USER_NAME_SECTION = "Как тебя зовут?"
    USER_GENDER_SECTION = "Выбери свой пол ⤵️"
    PREFERRED_GENDER_SECTION = "Фото какого пола показывать?"
    PREFERRED_AGE_GROUP_SECTION = "Какой возраст будешь угадывать?"
    LOCATION_SECTION = "Из какого ты города?"
    USER_PHOTO = "Отправь свое фото ⤵️"
    COMPLETED_USER_INFO = "Твоя анкета сохранена ✅"
    BUTTONS_WARNING = "Используй кнопки 🤺"


class IncorrectDataAnswer:
    INVALID_NAME = "Это не похоже на имя 🤔"
    INVALID_AGE = "Твой возраст должен быть от 14 до 30"
    INVALID_PHOTO = "Отправь фото, а не текст 😘"
    INVALID_BUTTONS_INPUT = "Используй кнопки 😘"
