class Answer:
    completed_user_profile = "Твоя анкета сохранена ✅"


class RegistrationSectionAnswer:
    age = "Сколько тебе лет?"
    name = "Как тебя зовут?"
    gender = "Выбери свой пол ⤵️"
    preferred_gender = "Фото какого пола показывать?"
    preferred_age_group = "Какой возраст будешь угадывать?"
    location = "Из какого ты города?"
    photo = "Отправь свое фото ⤵️"


class IncorrectDataAnswer:
    name = "Это не похоже на имя 🤔"
    age = "Твой возраст должен быть от 14 до 30"
    photo = "Отправь фото, а не текст 😘"
    input = "Используй кнопки 😘"
